bicycles = ['trek', 'redline', 'specialized']
print(bicycles)

print("----------------------------------------------------------------------------------------")

print(bicycles[0])

print("----------------------------------------------------------------------------------------")

# 通过-号访问倒数的元素
print(bicycles[-1])

print("----------------------------------------------------------------------------------------")

print(bicycles[0].title())

print("----------------------------------------------------------------------------------------")

bicycles = ['trek', 'redline', 'specialized']
bicycles[0] = "test"
print(bicycles)

print("----------------------------------------------------------------------------------------")

# 在列表末尾添加元素
bicycles = ['trek', 'redline', 'specialized']
bicycles.append("test1")
print(bicycles)

print("----------------------------------------------------------------------------------------")

# 通过insert将元素插入指定位置
bicycles = ['trek', 'redline', 'specialized']
bicycles.insert(1, "test")
print(bicycles)

print("----------------------------------------------------------------------------------------")

# 通过del删除指定位置的元素
bicycles = ['trek', 'redline', 'specialized']
del bicycles[1]
print(bicycles)

print("----------------------------------------------------------------------------------------")

bicycles = ['trek', 'redline', 'specialized']
test = bicycles.pop()
print(test)
print(bicycles)

print("----------------------------------------------------------------------------------------")

bicycles = ['trek', 'redline', 'specialized']
test = bicycles.pop(1)
print(test)
print(bicycles)

print("----------------------------------------------------------------------------------------")

bicycles = ['trek', 'redline', 'specialized', 'trek']
test = bicycles.remove("trek")
print(bicycles)

print("----------------------------------------------------------------------------------------")

# 使用sort()方法按照首字母大小写进行排序
cars = ["bmw", "audi", "subaru"]
cars.sort()
print(cars)

print("----------------------------------------------------------------------------------------")

# 使用sort()方法按照首字母大小写进行反向排序
# 需要注意的是在Python中，True And False 是首字母大写
cars = ["bmw", "audi", "subaru"]
cars.sort(reverse=True)
print(cars)

print("----------------------------------------------------------------------------------------")

cars = ["bmw", "audi", "subaru"]
print(sorted(cars, reverse=True))
print(cars)

print("----------------------------------------------------------------------------------------")

# 使用reverse()方法对列表进行永久排序，但是并非是按照字母顺序进行排序，而是按照先后顺序进行倒着排序
cars = ["bmw", "audi", "subaru"]
cars.reverse()
print(cars)
print("----------------------------------------------------------------------------------------")

# 使用len()方法计算列表长度，该方法从1开始计算
cars = ["bmw", "audi", "subaru"]
print(len(cars))
print("----------------------------------------------------------------------------------------")
print("----------------------------------------------------------------------------------------")
print("----------------------------------------------------------------------------------------")
print("----------------------------------------------------------------------------------------")
